package bbc.y2021a;

/**
 * 题目描述
 * 由于沙之国长年干旱，法师小明准备施展自己的一个神秘法术来求雨。
 * 这个法术需要用到他手中的49 张法术符，上面分别写着1 至49 这49 个数字。
 * 法术一共持续7 周，每天小明都要使用一张法术符，法术符不能重复使用。
 * 每周，小明施展法术产生的能量为这周7 张法术符上数字的中位数。
 * 法术施展完7 周后，求雨将获得成功，降雨量为7 周能量的中位数。
 * 由于干旱太久，小明希望这次求雨的降雨量尽可能大，请大最大值是多少？
 */
public class MaximumRainfall {
    public static void main(String[] args) {
        /*
         *    x x x 22 23 24 25
         *    x x x 26  .  .  .
         *    x x x 30  .  .  .
         *    x x x 34  .  .  .
         *    x x x 38  .  .  .
         *    x x x 42  .  .  .
         *    x x x 46  .  .  .
         *
         **/

        System.out.println(34);
    }
}
